Component({
  properties: {
    visible: {
      type: Boolean,
      default: false
    }
  },
  data: {
    ruleList: [
      {
        title: '抽奖参与方式:',
        isSort: true,
        contents: [
          '参与抽奖的用户需关注新华社抖音官方账号；',
          '活动期间新华社抖音官方账号将每日推出一期宠粉活动视频（共5期），参与抽奖的用户需点赞当天发布的宠粉活动视频',
          '抽奖入口为该条视频下方“快来抢，新华社宠粉福利”小程序，点击进入参与抽奖。'
        ]
      },
      {
        title: '活动奖励:',
        contents: [
          '参与抽奖的小伙伴将有机会获得由新华社提供的5期宠粉惊喜好礼，每期宠粉奖品如下：',
          'IQOO 7手机2台、巴黎欧莱雅美礼专列1个、巴黎欧莱雅复颜视黄醇精粹抗皱日霜25个、百雀羚套装(百雀羚帧颜淡纹修护精华液、百雀羚帧颜淡纹修护精华霜)20个、上好佳超大个田园薯片王一博人形抱枕及“一”见倾心大礼包50个、三只松鼠森林大礼包50个、1MORE PistonBuds真无线耳机5个、1MORE三单元头戴式耳机1个（单期预计发放礼品数量154份）',
          '奖品将在整体活动结束后10个工作日内快递方式寄出，如遇不可抗力等因素则顺延。'
        ]
      },
      {
        title: '活动时间:',
        isTable: true
      },
      {
        title: '温馨提示：',
        isSort: true,
        contents: [
          '抽奖活动仅限指定活动日10:00至24:00有效，其他时间段进入小程序无法参与抽奖；',
          '活动期间每人每天最多有3次抽奖机会；',
          '请参与用户提前保存关注新华社抖音官方账号的截图页面,方便中奖后填写资料上传。'
        ]
      },
      {
        title: '活动声明：',
        isSort: true,
        contents: [
          '中奖人需在24小时内在抽奖小程序中提交个人邮寄地址等相关信息，进行抽奖礼品兑换，逾期未提交将视为放弃；',
          '本活动所有时间均以以北京时间为准；',
          '中奖人提供的领奖人信息请确保准确真实，如提供信息有误，造成的一切后果自行承担；',
          '奖品图片仅供参考,请以实物为准；',
          '本活动最终解释权归属新华社抖音官方账号所有。'
        ]
      }
    ]
  },
  methods: {
    /**
     * 关闭窗口
     */
    cancelWin() {
      console.log('start', this.properties)
      this.triggerEvent("cancel", false, { bubbles: true })
    }
  }
})