Component({
  properties: {},
  data: {
    ruleList: [
      {
        title: '活动时间：',
        isTable: true
      },
      {
        title: '参与方式：',
        isSort: true,
        contents: [
          '关注新华社抖音官方账号并截图；',
          '点赞新华社抖音号在活动当天推出的宠粉活动视频,点击该条视频下方小程序参与抽奖。'
        ]
      },
      {
        title: '活动奖励：',
        contents: [
          '参与抽奖的小伙伴将有机会获得由新华社提供的宠粉好礼，每期宠粉奖品如下：',
          'IQOO 7手机2台、巴黎欧莱雅美礼专列1个、巴黎欧莱雅复颜视黄醇精粹抗皱日霜25个、百雀羚套装(百雀羚帧颜淡纹修护精华液、百雀羚帧颜淡纹修护精华霜)20个、上好佳"一"见倾心大礼包和限定礼品50个、三只松鼠森林大礼包50个、1MORE PistonBuds真无线耳机5个、1MORE三单元头戴式耳机1个（每期预计发放礼品数量154份）',
          '奖品将在整体活动结束后10个工作日内快递方式寄出，如遇不可抗力等因素则顺延。'
        ]
      },
      {
        title: '温馨提示：',
        isSort: true,
        contents: [
          '抽奖仅限指定活动日10:00至24:00有效，其他时间段进入小程序无法参与抽奖；',
          '期间每人每天最多有3次抽奖机会；',
          '请参与用户提前保存关注新华社抖音官方账号的截图页面,方便中奖后填写资料上传。'
        ]
      },
      {
        title: '活动声明：',
        isSort: true,
        contents: [
          '中奖人需在24小时内在抽奖小程序中提交个人邮寄地址等相关信息，进行抽奖礼品兑换，逾期未提交将视为放弃；',
          '本活动所有时间均以以北京时间为准；',
          '中奖人提供的领奖人信息请确保准确真实，如提供信息有误，造成的一切后果自行承担；',
          '奖品图片仅供参考,请以实物为准；',
          '本活动最终解释权归属新华社抖音官方账号所有。'
        ]
      }
    ]
  },
  methods: {}
})